## Importing libraries

In [177]:
import numpy as np 
import pandas as pd
from functools import reduce

## Importing dataset

In [178]:
xbox_gt = pd.read_csv("xboxonegt.csv")

In [179]:
ps4_gt = pd.read_csv("ps4gt.csv")

In [180]:
videogame_gt = pd.read_csv("vggt.csv")

## pre - processing for xbox

In [181]:
xbox_gt.head()

             Category: All categories
Week        Xbox One: (United States)
2017-09-17                         38
2017-09-24                         36
2017-10-01                         35
2017-10-08                         37

In [182]:
xbox_gt=xbox_gt.reset_index()

In [183]:
xbox_gt1=xbox_gt.drop(index=0,axis=1)

In [184]:
xbox_gt1.isna().sum()

index                       0
Category: All categories    0
dtype: int64

## renaming the columns

In [185]:
xbox_gt1 = xbox_gt1.rename(columns={'index': 'week','Category: All categories':'searched_count_xbox'})
xbox_gt1.head()

         week searched_count_xbox
1  2017-09-17                  38
2  2017-09-24                  36
3  2017-10-01                  35
4  2017-10-08                  37
5  2017-10-15                  37

## Data typing and extracting date and month

In [186]:
xbox_gt1['week']=xbox_gt1['week'].astype('datetime64[ns]') 
xbox_gt1['year_of_order']=xbox_gt1['week'].dt.year

xbox_gt1['week']

1     2017-09-17
2     2017-09-24
3     2017-10-01
4     2017-10-08
5     2017-10-15
         ...
256   2022-08-07
257   2022-08-14
258   2022-08-21
259   2022-08-28
260   2022-09-04
Name: week, Length: 260, dtype: datetime64[ns]

In [187]:
xbox_gt1.head()

        week searched_count_xbox  year_of_order
1 2017-09-17                  38           2017
2 2017-09-24                  36           2017
3 2017-10-01                  35           2017
4 2017-10-08                  37           2017
5 2017-10-15                  37           2017

## pre processing for ps4

In [188]:
ps4_gt.head()

           Category: All categories
Week           ps4: (United States)
2017-09-17                       18
2017-09-24                       17
2017-10-01                       18
2017-10-08                       18

In [189]:
ps4_gt=ps4_gt.reset_index()

In [190]:
ps4_gt1=ps4_gt.drop(index=0,axis=1)

In [191]:
ps4_gt1.isna().sum()

index                       0
Category: All categories    0
dtype: int64

## renaming the columns

In [192]:
ps4_gt1= ps4_gt1.rename(columns={'index': 'week','Category: All categories':'searched_count_ps4'})
ps4_gt1.head()

         week searched_count_ps4
1  2017-09-17                 18
2  2017-09-24                 17
3  2017-10-01                 18
4  2017-10-08                 18
5  2017-10-15                 18

### Data typing and extracting date and year

In [193]:
ps4_gt1['week']=ps4_gt1['week'].astype('datetime64[ns]') 
ps4_gt1['year_of_order']=ps4_gt1['week'].dt.year
ps4_gt1['week']

1     2017-09-17
2     2017-09-24
3     2017-10-01
4     2017-10-08
5     2017-10-15
         ...
256   2022-08-07
257   2022-08-14
258   2022-08-21
259   2022-08-28
260   2022-09-04
Name: week, Length: 260, dtype: datetime64[ns]

In [194]:
ps4_gt1.head()

        week searched_count_ps4  year_of_order
1 2017-09-17                 18           2017
2 2017-09-24                 17           2017
3 2017-10-01                 18           2017
4 2017-10-08                 18           2017
5 2017-10-15                 18           2017

### pre processing for videogame dataset

In [195]:
videogame_gt.head()

                Category: All categories
Week        video games: (United States)
2017-09-17                            53
2017-09-24                            54
2017-10-01                            48
2017-10-08                            56

In [196]:
videogame_gt=videogame_gt.reset_index()
videogame_gt1=videogame_gt.drop(index=0,axis=1)

In [197]:
videogame_gt1.isna().sum()

index                       0
Category: All categories    0
dtype: int64

### renaming the columns

In [198]:
videogame_gt1= videogame_gt1.rename(columns={'index': 'week','Category: All categories':'searched_count_video_game'})
videogame_gt1.head()

         week searched_count_video_game
1  2017-09-17                        53
2  2017-09-24                        54
3  2017-10-01                        48
4  2017-10-08                        56
5  2017-10-15                        57

### Data typing and extracting date and year

In [199]:
videogame_gt1['week']=videogame_gt1['week'].astype('datetime64[ns]') ## Data typing and extracting date and month
videogame_gt1['year_of_order']=videogame_gt1['week'].dt.year
#videogame_gt1['week']=videogame_gt1['week'].dt.date
videogame_gt1['week']

1     2017-09-17
2     2017-09-24
3     2017-10-01
4     2017-10-08
5     2017-10-15
         ...
256   2022-08-07
257   2022-08-14
258   2022-08-21
259   2022-08-28
260   2022-09-04
Name: week, Length: 260, dtype: datetime64[ns]

In [200]:
videogame_gt1.head()

        week searched_count_video_game  year_of_order
1 2017-09-17                        53           2017
2 2017-09-24                        54           2017
3 2017-10-01                        48           2017
4 2017-10-08                        56           2017
5 2017-10-15                        57           2017

In [201]:
videogame_gt1.to_csv('videogame_file.csv')

In [202]:
ps4_gt1.to_csv('ps4_file.csv')

In [203]:
xbox_gt1.to_csv('xbox_file.csv')

## merging the datasets

In [204]:
trends = reduce(lambda left, right:     
                     pd.merge(left , right,
                              on = ["year_of_order","week"]),
                     [videogame_gt1,ps4_gt1,xbox_gt1])
trends

,week,searched_count_video_game,year_of_order,searched_count_ps4,searched_count_xbox
0,2017-09-17,53,2017,18,38
1,2017-09-24,54,2017,17,36
2,2017-10-01,48,2017,18,35
3,2017-10-08,56,2017,18,37
4,2017-10-15,57,2017,18,37
...,...,...,...,...,...
255,2022-08-07,51,2022,12,32
256,2022-08-14,54,2022,12,31
257,2022-08-21,54,2022,11,30
258,2022-08-28,52,2022,10,28
259,2022-09-04,55,2022,11,30

In [205]:
trends.to_csv('trends.csv')